-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Mar 30, 2023 at 07:23 PM
-- Server version: 10.4.24-MariaDB
-- PHP Version: 8.1.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `bookportal`
--

-- --------------------------------------------------------

--
-- Table structure for table `bookinfo`
--

CREATE TABLE `bookinfo` (
  `id` int(11) NOT NULL,
  `title` varchar(100) NOT NULL,
  `author` varchar(100) NOT NULL,
  `category` varchar(100) NOT NULL,
  `publisher` varchar(100) NOT NULL,
  `edition` varchar(100) NOT NULL,
  `language` varchar(100) NOT NULL,
  `price` int(11) NOT NULL,
  `pages` int(11) NOT NULL,
  `book_summary` text NOT NULL,
  `status` int(11) NOT NULL,
  `image` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `bookinfo`
--

INSERT INTO `bookinfo` (`id`, `title`, `author`, `category`, `publisher`, `edition`, `language`, `price`, `pages`, `book_summary`, `status`, `image`) VALUES
(382, 'বেলা ফুরাবার আগে', 'Arif Azad', 'Islamic', 'Gardiun', '1st', 'Bangla', 250, 300, '<p> <b> বেলা ফুরাবার আগে <b/> </p>\r\n<p>\r\nনিজেকে আবিষ্কারের একটি আয়না। যে ভুল আর ভ্রান্তির মোহে, অন্ধকারের যে অলিগলিতে আমাদের এতোদিনকার পদচারণা, তার বিপরীতে জীবনের নতুন অধ্যায়ে নিজের নাম লিখিয়ে নিতে একটি সহায়ক গ্রন্থ এই বই, ইন শা আল্লাহ। </p>\r\n\r\n<p>বইটি কাদের জন্য? </p>\r\n\r\n<p>এই বই তাদের জন্য যারা কাছে ‘সাজিদ হতে চাই’ বলে বিভিন্ন সময়ে আবদার করেন। পরামর্শের আবদার, পথনির্দেশের আবদার। সাজিদ হতে হলে, আমি মনে করি, সবার আগে একটা অন্ধকার বৃত্ত থেকে আমাদের বেরিয়ে আসতে হবে। সাজিদ যেভাবে অন্ধকারের কৃষ্ণগহ্বর ছেড়ে, আলোর ফোয়ারাতে তার জীবন রাঙিয়েছে, সেরকম ঝলমলে আলোর মাঝে নিজেকে মেলে ধরাই ‘সাজিদ’ হবার প্রথম এবং প্রধান শর্ত। কেবল ভারি ভারি বই আর যুক্তির পশরা সাজিয়ে প্রতিপক্ষকে পরাস্ত করার মধ্যেই ‘সাজিদ’ হয়ে উঠার সার্থকতা নেই। সাজিদ হয়ে উঠার সার্থকতা তখনই যখন সাজিদ যে আদর্শের আলো প্রাণে প্রাণে ছড়িয়ে দিতে চায়, তা আমরা জীবনে মেখে নিতে পারবো। বইটি কাদের জন্য? ভুলোমনা একঝাঁক তারুণ্যের জন্য এই বই। যে ভুলের গহ্বরে তারা জীবনের বসন্তগুলোকে পার করছে, সেই ভুল থেকে তাদের ‘বেলা ফুরাবার আগে’ টেনে তুলতেই এই বইটার অবতারণা। এর বাইরেও থাকছেঃ ‘চোখের রোগ’, ‘বলো, সুখ কোথা পাই’, ‘বেলা ফুরাবার আগে’, ‘মেঘের কোলে রোদ হেসেছে’, ‘যুদ্ধ মানে শত্রু শত্রু খেলা’, ‘চলে যাওয়া মানে প্রস্থান নয়’, ‘বসন্ত এসে গেছে’, ‘তুলি দুই হাত করি মোনাজাত’, ‘চলো বদলাই’ নামের আঠারোটি ভিন্ন ভিন্ন বিষয়ে, ভিন্ন ভিন্ন অধ্যায়।\r\n</p>\r\n', 1, 'bela-purabar-age.png'),
(387, 'এবার ভিন্ন কিছু হোক', 'Arif Azad', 'Islamic', 'Somokalin', '2nd', 'Bangla', 250, 350, '<b> <p> \'এবার ভিন্ন কিছু হোক\' </b> </p>\r\n<p>প্রতিদিন একটা একঘেয়েমি চক্রে কেটে যাচ্ছে জীবনের প্রতিটি মুহূর্ত। মাঝে মাঝে আফসোস লাগে—এভাবে একটা জীবন চলতে পারে? এভাবেই কি ক্ষয়ে যাওয়ার কথা আস্ত একটা জীবন? কী পাওয়ার বদলে কী হারাচ্ছি জীবন থেকে? </p>\r\n\r\n<p>জীবনে একটা বদল প্রয়োজন, একটা পরিবর্তন ভীষণ জরুরি—তা আমরা কিন্তু কীভাবে শুরু করবো? ঠিক কোথা থেকে যাত্রা করবো নতুন এক দিনের? কীভাবে মেলে ধরবো নিজের সবটুকু সম্ভাবনা? কীভাবে পেছনে ফেলে আসবো সকল ব্যর্থতা? যে অন্ধকারে হারিয়ে খুঁজে বেড়াচ্ছি নিজেকে, কীভাবে সেখানে ঘটবে আলোর স্ফুরণ? একটা নতুন ভোরে, দখিনের জানালার পাশে বসে কিংবা পছন্দের কোনো জায়গা আর সময়-সুযোগ বুঝে খুলে বসতে পারেন ‘এবার ভিন্ন কিছু হোক’ বইটি। যে প্রশ্নগুলোর উত্তর পাবার আশায় আপনি চাতক পাখির মতো তাকিয়ে, হৃদয়ের উঠোনে যে এক পশলা ঝুম বৃষ্টির প্রতীক্ষায় আপনি গুনে চলেছেন অজস্র প্রহর, ইনশাআল্লাহ বইটি আপনাকে সেই কাঙ্ক্ষিত মুহূর্তগুলো উপহার দেবে। জীবনের এক নতুন উপাখ্যান রচনায় বইটি হতে পারে আপনার নিত্যদিনের সাথি। </p>', 1, 'ebar-vinno.jpg'),
(388, 'আহ্বান', 'Mizanur Rahman Azhari', 'Islamic', 'Gardiun', '1st', 'Bangla', 150, 200, '<p><b> আহ্বান </b> </p>\r\n<p>\r\nদয়াময় রব গোটা সৃষ্টিজগৎকে সাজিয়েছেন অপরূপ নৈপুণ্যে, সর্বত্র ছড়িয়ে দিয়েছেন অনুপম কারুকার্যের হাজারো নিদর্শন। কত বদল আর বৈচিত্র্যে ঠাসা এ চরাচর! যেন প্রভুর পরম আসমানি স্পর্শ লেগে আছে প্রতিটি কোণে। একেক সৃষ্টিকে তৈরি করেছেন একেক ব্যঞ্জনায়। এজন্যই তো অহংকার তাঁর আপন চাদর। আমাদের যত প্রার্থনা ও স্তুতি —সকলই কেবল তাঁকে ঘিরে। তিনিই মানুষকে পাঠিয়েছেন জোড়ায় জোড়ায়; একে অন্যের ভূষণরূপে। আমাদের সমৃদ্ধ করেছেন উত্তম রিজিকে, প্রখর মেধা আর তারুণ্যের প্রাণোচ্ছল চঞ্চলতায়। ভরসার ছায়া আর অবারিত অনুগ্রহে আগলে রেখেছেন তামাম কুল-কায়েনাত। \r\n</p>\r\n\r\n<p>এসবরই স্বচ্ছন্দ ও সুখপাঠ্য পর্যালোচনা হাজির করেছেন বর্তমান সময়ের তুমুল জনপ্রিয় দাঈ শাইখ মিজানুর রহমান আজহারি। সেইসঙ্গে তরুণ প্রজন্মের সামনে পেশ করেছেন সুস্থ-সুন্দর, সময়োপযোগী ও ঈমানদীপ্ত জীবনের নববি চালচিত্র। সময়ের সবুজ সওয়ারিদের আহ্বান করেছেন গৌরবময় সত্যের পথে।\r\n</p>', 1, 'Ahobban.jpg'),
(394, 'নেভার স্টপ লার্নিং', 'Ayman Sadik', 'Fiction', 'Gardiun', '2nd', 'Bangla', 280, 319, '<p><b>\'নেভার স্টপ লার্নিং\' </b></p>\r\n<p>একবিংশ শতাব্দির এই প্রতিযোগিতার মাঝে পাঠ্যবইয়ের জ্ঞানের পাশাপাশি একজন ছাত্রের প্রয়োজন বাস্তব জীবনের কিছু কোশল ও হ্যাক সম্পর্কে জানা। আর সেইসব কৌশল ও হ্যাক নিয়েই লিখা \"Never Stop learning\" বইটি। অনলাইনের মাধ্যমে শিক্ষাকে দেশের প্রত্যেকটি সাধারন শিক্ষার্থীর কাছে পৌছে দেওয়া সাদিক বর্তমানে হাজারো তরুনের অনুপ্রেরণা। কিন্তু শুধুমাত্র মানসম্পন্ন একাডেমিক শিক্ষাকে সবার দ্বারপ্রান্তে পৌছে দিয়েই থেমে নেই মানুষটি। ইউটিউব ও ফেসবুকের মাধ্যমে প্রতিনয়তই নতুন নতুন কৌশল ও হ্যাক শেখানোর প্রচেষ্টা করে যাচ্ছে যা একজন শিক্ষার্থীকে প্রকৃতপক্ষেই একজন সফল ও যোগ্য নাগরিক হয়ে গড়ে উঠতে সাহায্য করবে। আর সেসব প্রচেষ্টার নতুন সংযোজন \"Never Stop learning\" বইটি। বইটিতে আছে একজন সামাদ চাচার গল্প, যিনি দরিদ্র হওয়া সত্তেও জীবনের শেষ দিন পর্যন্ত একটি করে গাছ লাগিয়ে গেছেন। ভোকাবুলারি জয় করতে চাও, সেটার ৫ টি উপায় আছে বইটিতে। ছাত্রজীবনে অর্থ উপার্জনের উপায় থেকে সুন্দর মানসিকতা তৈরীর কৌশল সহ বইটির ৪৭ টি অধ্যায়ের প্রতিটিতেই লুকিয়ে রয়েছে কিছু আইডিয়া ও মেসেজ, যা আমাদের সমাজ জীবনের প্রতিটি ক্ষেত্রে এগিয়ে থাকতে আমাদের সাহায্য করতে পারে। বর্তমানে আমাদের দেশের ছাত্রসমাজের সবচেয়ে বড় সমস্যা হতাশা। কিন্তু দুঃখের বিষয় সেই হতাশাকে কাটিয়ে সামনে এগিয়ে যাওয়ার আশার আলো দেখানোর মত কেউ নেই। এমন অবস্থায় হতাশা কাটিয়ে জীবনের প্রত্যেকটি ক্ষেত্রে সমান ভাবে সফলতা অর্জনের দিকনির্দেশকের ভূমিকা পালন করতে পারে এই বইটি। অত্যন্ত সততা এবং সরলতার সাথে রচনা করা এই বইটি দৃঢ়প্রত্যয়ী তরুনদের উৎসর্গ করে লেখা হলেও বইটি পড়ে সমাজের সব শ্রেনীর ও সব বয়সের মানুষই উপকৃত হবে। </p>\r\n\r\n', 1, 'নেভার-স্টপ-লা.png'),
(400, 'programming', 'Ayman Sadik', 'Non-fiction', 'Gardiun', '2nd', 'English', 450, 50, 'something', 1, 'images.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `form_data`
--

CREATE TABLE `form_data` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `email` varchar(100) NOT NULL,
  `file_name` text NOT NULL,
  `submitted_on` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `form_data`
--

INSERT INTO `form_data` (`id`, `name`, `email`, `file_name`, `submitted_on`) VALUES
(1, 'dfs', 'd@g.com', '330931843.jpg', 2147483647),
(2, 'iuo', 'o@g.com', '1603954106-marketing.jpg', 2147483647),
(3, 'dfs', 'sdf@gmail.com', '330931843.jpg', 2147483647),
(4, 'dfs', 'sdf@gmail.com', '330931843.jpg', 2147483647),
(5, 'dfs', 'sdf@gmail.com', '330931843.jpg', 2147483647),
(6, 'rt', 'rt@g.com', '330931843.jpg', 2147483647),
(7, 'r', 'r@r.com', '1666156136687.jpg', 2147483647),
(8, 'df', 'd@d.com', '330931843.jpg', 2147483647),
(9, 'd', 'd@d.xom', 'eBooks-Ipad.jpg', 2147483647),
(10, 'f', 'ffff@f.com', 'eb.jpg', 2147483647),
(11, 'f', 'd@d.n', 'kk.jpg', 2147483647),
(12, 'd', 'd@dddddd.com', '330931843.jpg', 2147483647),
(13, 'd', 'd@r.c', 'Screenshot_3.png', 2147483647),
(14, 'd', 'y@g.sa', 'Screenshot_11.png', 2147483647),
(15, 'f', 'fw@ga.com', 'Screenshot_g1.png', 2147483647),
(16, 'f', 'fw@ga.com', 'eb.jpg', 2147483647),
(17, 'fd', 'e@d.com', 'Screenshot_9.png', 2147483647),
(18, 'g', 'g@g.c', 'Screenshot_11.png', 2147483647),
(19, 'ttt', 'Arif Azad', 'ai.png', 2147483647);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `bookinfo`
--
ALTER TABLE `bookinfo`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_image_constraint` (`image`);

--
-- Indexes for table `form_data`
--
ALTER TABLE `form_data`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `bookinfo`
--
ALTER TABLE `bookinfo`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=401;

--
-- AUTO_INCREMENT for table `form_data`
--
ALTER TABLE `form_data`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
